public class Main {

    public static void main(String[] args) {

/*
        Задание 8.1
            Пример использования хеш-таблиц:
                - создание базы данных с быстрым поиском предмета по ключу;
                - храниение логинов и паролей


        Задание 8.2
            Ключ – входной массив, идентификатор для доступа/поиска значения в хеш-таблице.
            Ключами могут быть числа, массивы, строки и т.д.
            Например: "Слово", 500.

            Коллизия - ситуация, при которой два или более ключей совпадают с полученным в итоге хешем.


        Задание 8.3. Приведите примеры популярных и эффективных хеш-функций.
            Примеры популярных и эффективных хеш-функций:
                - Суммирование
                - Возведение в степень
*/


    }

}
